Revit 2022 API
IFCProjectLevelGUIDType Enumeration
 The type of the GUID to be retrieved from Revit.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2013
Syntax
C#
[ObsoleteAttribute("This enum is deprecated as of Revit 2022, as it was only used for the deprecated function CreateProjectLevelGUID.")]
public enum IFCProjectLevelGUIDType
Visual Basic
<ObsoleteAttribute("This enum is deprecated as of Revit 2022, as it was only used for the deprecated function CreateProjectLevelGUID.")> _
Public Enumeration IFCProjectLevelGUIDType
Visual C++
[ObsoleteAttribute(L"This enum is deprecated as of Revit 2022, as it was only used for the deprecated function CreateProjectLevelGUID.")]
public enum class IFCProjectLevelGUIDType
Members
Member name | Description
Project |  The project GUID.
Building |  The building GUID.
Site |  The site GUID.
See Also
Autodesk.Revit.DB.IFC Namespace